# DistributionJustification Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BalusterPattern..::..DistributionJustification Property
BalusterPattern Class See Also
---
Determines how baluster pattern distribution is justified.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public PatternJustification DistributionJustification { get; set; }
```

Visual Basic
---
```text
Public Property DistributionJustification As PatternJustification
	Get
	Set
```

Visual C++
---
```text
public:
property PatternJustification DistributionJustification {
	PatternJustification get ();
	void set (PatternJustification value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
BalusterPattern Class
Autodesk.Revit.DB.Architecture Namespace